<template>
    <div style="width: 100px">
        <Tooltip :lineNumber="1" :text="'我是一个提我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示我是一个提示示'" />

    </div>
  </template>
  
  <script setup>
  import Tooltip from './components/Tooltip.vue'
  </script>
  